[
  {
    "id": 1,
    "title": "Logiciel de gestion de jeux associatifs",
    "summary": "Une solution complète pour la gestion et l’organisation d’événements ludiques en ligne.",
    "description": [
      "Développement d’une plateforme permettant la coordination et l’optimisation des activités liées aux jeux associatifs. L’accent a été mis sur l’accessibilité, la fluidité de l’expérience utilisateur et la gestion des interactions en temps réel.",
      "Participation active à l’intégration du système avec d’autres plateformes et services, assurant une compatibilité optimale et une synchronisation efficace.",
      "Mise en place de solutions techniques garantissant la pérennité, la sécurité des données et la scalabilité du projet afin de répondre aux besoins évolutifs des utilisateurs."
    ],
    "links": [],
    "linkNames": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737830793/windev_dev_hiedpv.webp"
    ]
  },
  {
    "id": 2,
    "title": "Portfolio - MERN",
    "summary": "Un portfolio interactif mettant en avant mes compétences en développement web fullstack.",
    "description": [
      "Développé avec la stack MERN (MongoDB, Express, React, Node.js), ce portfolio présente mes réalisations à travers une interface moderne et réactive.",
      "J’ai intégré un mode sombre, une navigation fluide et des animations dynamiques pour améliorer l’expérience utilisateur.",
      "Ce projet illustre mes compétences en intégration d’API, gestion d’authentification, optimisation des performances et responsive design."
    ],
    "links": [
      "https://marvel-miguel.netlify.app/",
      "https://vinted-miguel.netlify.app/"
    ],
    "linkNames": [
      "Marvel Clone - Recherche de super-héros",
      "Vinted Clone - Marketplace de seconde main"
    ],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737735173/mern_i1ubic.png"
    ]
  },
  {
    "id": 3,
    "title": "Logiciel de logiciel de gestion de stock industriel",
    "summary": "Conception et développement d’un logiciel SaaS pour la gestion et l’optimisation des stocks de matériel industriel.",
    "description": [
      "Développement d'une solution sur mesure permettant la gestion efficace des stocks et des équipements industriels, avec un suivi précis des mouvements de matériel.",
      "Mise en place d’un système SaaS accessible sur PC, offrant aux utilisateurs un accès centralisé aux données en temps réel, avec des fonctionnalités avancées de reporting et d’analyse.",
      "Optimisation de la gestion des entrées et sorties de matériel, intégration de systèmes de traçabilité et automatisation des processus pour améliorer la productivité et réduire les erreurs.",
      "Sécurisation et hébergement du logiciel dans un environnement cloud, garantissant une disponibilité élevée et une évolutivité adaptée aux besoins de l’entreprise."
    ],
    "links": [],
    "linkNames": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737831426/industriel_q9m2f1.webp"
    ]
  },
  {
    "id": 4,
    "title": "QuizTime",
    "summary": "Une plateforme de jeux de questions A B C D",
    "description": [
      "J’ai développé le jeu QuizTime en 2022 en utilisant Arduino (C++) et WinDev (WLangage) pour concevoir un système de quiz interactif avec pupitres électroniques et boutons lumineux.",
      "Mon rôle comprenait la programmation du jeu, la conception des circuits électroniques et l’installation sur site pour assurer son bon fonctionnement.",
      "En 2024, j’ai modernisé le système en améliorant l’électronique et les performances logicielles pour optimiser la fiabilité du jeu.",
      "Ce projet illustre ma capacité à concevoir des systèmes interactifs et à assurer leur évolution dans le temps."
    ],
    "links": [],
    "linkNames": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737828733/quiztime2_kbxed6.jpg",
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737829811/quiztime3_sydvvt.webp"
    ]
  },
  {
    "id": 5,
    "title": "Livret d'accueil numérique",
    "summary": "Un outil digital facilitant l’accueil et l’information des voyageurs dans les hébergements touristiques.",
    "description": [
      "Développement d’une plateforme intuitive permettant aux propriétaires de gîtes et locations saisonnières de créer un livret d'accueil personnalisé et interactif.",
      "Mise en place d’un système de gestion de contenu permettant d’ajouter des informations essentielles : règles du logement, recommandations locales, consignes d’utilisation des équipements, et contacts utiles.",
      "Optimisation de l’accessibilité via une interface web ergonomique et responsive, garantissant une expérience fluide sur mobile, tablette et PC.",
      "Intégration de fonctionnalités avancées telles que la traduction automatique, les QR codes pour un accès rapide et la gestion multi-propriétés."
    ],
    "links": [],
    "linkNames": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737832585/livret_boqb0i.png"
    ]
}

]
