[
  {
    "id": 4,
    "title": "Logiciel de gestion de jeux associatifs",
    "summary": "Une solution complète pour la gestion et l’organisation d’événements ludiques en ligne.",
    "description": [
      "En tant que développeur et chef de projet, j’ai conçu et optimisé un logiciel de gestion dédié aux jeux associatifs. Mon rôle ne s’est pas limité au développement technique : j’ai également assuré la gestion des serveurs, la sécurisation des données et la mise en place des échanges avec les clients et les utilisateurs finaux.",
      "J’ai dirigé l’intégration du logiciel avec le site web, garantissant une synchronisation fluide et une expérience utilisateur optimale. Cette intégration a permis d’assurer une interopérabilité efficace avec d’autres plateformes et services tiers.",
      "En tant que responsable du projet, j’ai supervisé chaque étape du développement, du concept initial à la mise en production, en passant par les mises à jour et les améliorations continues, afin de garantir la pérennité et l’évolutivité du système.",
      "Grâce à une vision globale et une expertise technique approfondie, j’ai mis en place des solutions assurant la performance, la fiabilité et la scalabilité du projet."
    ],
    "links": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737998820/loto_jcxrzc.webp"
    ]
  },
  {
    "id": 3,
    "title": "QuizTime",
    "summary": "Une plateforme de quiz interactif combinant électronique et programmation, conçue pour des compétitions dynamiques.",
    "description": [
      "J’ai développé le jeu QuizTime en 2022 en utilisant Arduino (C++) et WinDev (WLangage) pour concevoir un système de quiz interactif avec pupitres électroniques et boutons lumineux.",
      "L’Arduino, programmé en C++, gère toute la partie électronique, incluant la gestion des boutons, l’éclairage des pupitres et la transmission des réponses.",
      "L’ensemble du système est centralisé sur un seul PC, qui contrôle le jeu et affiche les questions et scores sur les écrans des pupitres.",
      "La communication entre l’Arduino et le PC s’effectue via une connexion Ethernet, assurant une transmission rapide et fiable des données.",
      "Ce projet illustre ma capacité à concevoir des systèmes interactifs en intégrant programmation, électronique et connectivité réseau."
    ],
    "links": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737828733/quiztime2_kbxed6.jpg",
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737829811/quiztime3_sydvvt.webp"
    ]
  },
  {
    "id": 2,
    "title": "Livret d'accueil numérique",
    "summary": "Un outil digital facilitant l’accueil et l’information des voyageurs dans les hébergements touristiques.",
    "description": [
      "Développement d’une plateforme intuitive permettant aux propriétaires de gîtes et locations saisonnières de créer un livret d'accueil personnalisé et interactif.",
      "Mise en place d’un système de gestion de contenu permettant d’ajouter des informations essentielles : règles du logement, recommandations locales, consignes d’utilisation des équipements, et contacts utiles.",
      "Optimisation de l’accessibilité via une interface web ergonomique et responsive, garantissant une expérience fluide sur mobile, tablette et PC.",
      "Intégration de fonctionnalités avancées telles que la traduction automatique, les QR codes pour un accès rapide."
    ],
    "links": [],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1738020875/Capture_d_e%CC%81cran_2025-01-28_a%CC%80_00.33.11_q5tmg6.png",
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737990541/Capture_d_e%CC%81cran_2025-01-27_a%CC%80_15.59.31_kgttvq.png"
    ]
  },
  {
    "id": 1,
    "title": "Vinted Clone",
    "summary": "Une plateforme d’achat et de vente de vêtements d’occasion inspirée du site Vinted.",
    "description": [
      "Ce projet fullstack a été développé avec la stack MERN (MongoDB, Express, React, Node.js) pour reproduire les fonctionnalités principales de Vinted.",
      "Les utilisateurs peuvent créer un compte, publier des annonces avec images, filtrer les produits par prix et catégories, et simuler un paiement avec Stripe.",
      "J’ai porté une attention particulière à l’ergonomie et à la fluidité de navigation, tout en optimisant l’affichage pour une expérience optimale sur desktop uniquement."
    ],
    "links": [
      {
        "name": "Vinted Clone - Site de revente d’articles",
        "url": "https://vinted-miguel.netlify.app/"
      }
    ],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737989139/Capture_d_e%CC%81cran_2025-01-27_a%CC%80_15.45.26_aqshct.png"
    ]
  },
  {
    "id": 5,
    "title": "Marvel Clone",
    "summary": "Une application web permettant d’explorer l’univers Marvel à travers une interface fluide et intuitive.",
    "description": [
      "Développée avec la stack MERN (MongoDB, Express, React, Node.js), cette application permet aux utilisateurs de rechercher des personnages, comics et séries issus de l’univers Marvel grâce à l’API Marvel.",
      "J’ai intégré un système d’authentification, une gestion avancée des favoris pour offrir une expérience personnalisée.",
      "Ce projet met en avant mes compétences en intégration d’API, gestion d’état avec React, optimisation des performances et design responsive."
    ],
    "links": [
      {
        "name": "Marvel Clone - Recherche de super-héros",
        "url": "https://marvel-miguel.netlify.app/"
      }
    ],
    "images": [
      "https://res.cloudinary.com/dshznc4xx/image/upload/v1737988714/Capture_d_e%CC%81cran_2025-01-27_a%CC%80_15.38.02_odllgm.png"
    ]
  }
]
